# Pandas Dataframe 과 Series

In [1]:
import pandas as pd

In [2]:
# pd.Series(['banana',42])
pd.Series(['banana',42],index =['name','age'],name = 'kind')

name    banana
age         42
Name: kind, dtype: object

In [3]:
pd.DataFrame({
    'Name':['Framklin','Gosset'],
    'Born':['1920-07-25','1876-06-03'],
    'Age':['37','61']
})

       Name        Born Age
0  Framklin  1920-07-25  37
1    Gosset  1876-06-03  61

In [4]:
pd.DataFrame([[1,2,3,],[4,5,6],[7,8,9]],
             columns = ['a','b','c'])

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
df = pd.read_csv('data/scientists.csv')
df.head(2)

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician

In [20]:
df.tail(2)

           Name        Born        Died  Age          Occupation
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [10]:
df.sort_values(['Name','Age'],ascending=False)

                   Name        Born        Died  Age          Occupation
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
5             John Snow  1813-03-15  1858-06-16   45           Physician
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [12]:
df['Age'].to_frame()

   Age
0   37
1   61
2   90
3   66
4   56
5   45
6   41
7   77

In [13]:
df['Age'].mean()

59.125

In [14]:
# df [조건식] # Ture , False
df[df['Age'] >= df['Age'].mean() ]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [17]:
df[[True,False,True,False,True,False,True,False]]

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [20]:
df['Age'] + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [19]:
df['Age'] + pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64